Examinator/src/Catalogs/СтраницыСУЗ/СтраницыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраницыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <comment>Хранится краткое имя макета как оно задано в синониме перечисления</comment>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>CatalogRef.ШаблоныТекстаСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыОбъектовСУЗ/РесурсыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыОбъектовСУЗ</name>
  <owners>Catalog.СтраницыСУЗ</owners>
  <owners>Catalog.ВопросыСУЗ</owners>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СтраницыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.page;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Страница, ПараметрыСсылки, КонтекстВыполнения) Экспорт

	ИмяОбъектаСУЗ         = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	ПоставщикСводаЗнаний  = Справочники.СводыЗнанийСУЗ.Поставщик(КонтекстВыполнения.ЭлектронныйРесурс);
	ИдентификаторСтраницы = Страница.УникальныйИдентификатор();
	
	Если Страница.ИспользуетсяФорматированныйДокумент Тогда
		
		ФорматированныйДокумент = ОбъектыСУЗ.ПолучитьДанные(Страница, "ТекстСтраницы", Истина, "ФорматированныйДокумент", ПоставщикСводаЗнаний);
		
		ПредставлениеСтраницы = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, ИдентификаторСтраницы);
		
		Если ПредставлениеСтраницы.ЕстьВложения Тогда
			ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(Страница, КонтекстВыполнения.СписокРесурсов);
		КонецЕсли;
		
		ТекстСтраницы = ПредставлениеСтраницы.ПредставлениеHTML;		
		
		Если КонтекстВыполнения.ПараметрыЭкспорта <> Неопределено Тогда
			ОбщегоНазначенияСУКлиентСервер.ИсправитьBase64Строку(ТекстСтраницы);
		КонецЕсли;
		
	Иначе
		
		ТекстСтраницы = ОбъектыСУЗ.ПолучитьДанные(Страница, "ТекстСтраницы", Истина, "ТекстовыеДанные", ПоставщикСводаЗнаний);
		ТекстСтраницы = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстСтраницы);
		
	КонецЕсли;

	ОбъектыСУЗ.ДобавитьРесурсыОбъектаВМассивРесурсов(Страница, КонтекстВыполнения.СписокРесурсов, КонтекстВыполнения.СписокПодсказок);
	
	// Формируем XDTO
	
	СтраницаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Page","Страница");
	СтраницаXDTO     = ФабрикаXDTO.Создать(СтраницаXDTOТип);
	
	СтраницаXDTO.id           = Страница.УникальныйИдентификатор();
	СтраницаXDTO.object       = ИмяОбъектаСУЗ;
	СтраницаXDTO.Наименование = Страница.Наименование;
	СтраницаXDTO.Текст        = ТекстСтраницы;
	
	// Применяем шаблон к текстам
	
	Если ЗначениеЗаполнено(Страница.ШаблонТекста) Тогда
		
		// Получаем путь к основному ресурсу

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РесурсыОбъектовСУЗ.Ресурс
			|ИЗ
			|	Справочник.РесурсыОбъектовСУЗ КАК РесурсыОбъектовСУЗ
			|ГДЕ
			|	РесурсыОбъектовСУЗ.Владелец = &Страница
			|	И РесурсыОбъектовСУЗ.Основной = ИСТИНА";

		Запрос.УстановитьПараметр("Страница", Страница);

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			ВыборкаДетальныеЗаписи.Следующий();
			
			ИмяКаталогаОсновногоРесурса = Справочники.РесурсыСУЗ.ИмяКаталогаРесурса(ВыборкаДетальныеЗаписи.Ресурс);
			
		Иначе
			
			ИмяКаталогаОсновногоРесурса = "";
			
		КонецЕсли;

		// Обрабатываем тексты на основе шаблона
		
		СтраницаXDTO.Текст = ОбъектыСУЗ.ПрименитьШаблонКТексту(СтраницаXDTO.Текст, Страница.ШаблонТекста, ИмяКаталогаОсновногоРесурса); 	
				
	КонецЕсли;		
	
	// Формируем XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СтраницаXDTO);
	XMLДанные = ЗаписьXML.Закрыть();
	
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Страница);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
	
	// Добавляем ссылки на объекты
	
	ОбъектыСУЗ.ДобавитьСсылкиОбъектаВМассив(Страница, КонтекстВыполнения);
	
	Возврат XMLДанные;
	
КонецФункции

Функция УстановитьАвтоНаименование(СтартоваяСтраницаОбъект, РодительскийОбъект) Экспорт
	
	СтартоваяСтраницаОбъект.Наименование  = НСтр("ru = 'Стартовая страница теста ""%1""'");
	СтартоваяСтраницаОбъект.Наименование  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтартоваяСтраницаОбъект.Наименование, РодительскийОбъект.Наименование);
	
КонецФункции

#КонецЕсли
